# Базовый образ с чистым Python
FROM python:3.10-slim

# Указываем рабочую папку внутри контейнера
WORKDIR /app

# Копируем список зависимостей
COPY requirements.txt .

# Устанавливаем библиотеки
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь наш проект (код, датасет, готовую базу) внутрь контейнера
COPY . .

# Открываем порт 8000, на котором работает FastAPI
EXPOSE 8000

# Команда для запуска сервера при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
